{
  "regionsInfrastructure": {
    "title": "Régions et infrastructures"
  },
  "architecture": {
    "title": "Architecture de l'entreprise",
    "fetchError": "Échec de la récupération des données d'architecture",
    "noData": "Aucune donnée d'architecture disponible",
    "viewHierarchy": "Hiérarchie",
    "viewForce": "Forcer",
    "viewRadial": "Radiale",
    "legend": "Légende",
    "users": "Utilisatrices",
    "teams": "Équipes",
    "machines": "Machines",
    "regions": "Régions",
    "bridges": "Ponts",
    "repositories": "Référentiels",
    "schedules": "Horaires",
    "storages": "Stockage",
    "nodeCompany": "Entreprise",
    "nodeUser": "Utilisatrice",
    "nodeTeam": "Équipe",
    "nodeRegion": "Région",
    "nodeBridge": "Pont",
    "nodeMachine": "Machine",
    "nodeRepository": "Dépôt",
    "nodeSchedule": "Calendrier",
    "nodeStorage": "Stockage",
    "filterEntities": "Entités filtrées",
    "selectEntities": "Sélectionnez les types d'entités à afficher",
    "selectAll": "Sélectionnez tout",
    "clearAll": "Effacer tout",
    "noEntitiesSelected": "Aucune entité sélectionnée. Veuillez sélectionner au moins un type d'entité à afficher."
  },
  "dangerZone": {
    "title": "Zone de danger",
    "blockUserRequests": {
      "title": "Bloquer les demandes des utilisateurs",
      "description": "Empêchez tous les utilisateurs non administratifs de faire des demandes au système. Cela résiliera immédiatement toutes les sessions utilisateur actives à l'exception des administrateurs. Les utilisateurs devront être débloqués manuellement pour retrouver l'accès.",
      "blockButton": "Bloquer les demandes des utilisateurs",
      "unblockButton": "Débloquer les demandes des utilisateurs",
      "confirmBlock": {
        "title": "Bloquer les demandes des utilisateurs",
        "description": "Cette action sera:",
        "effect1": "Bloquer tous les utilisateurs non administratifs du système",
        "effect2": "Terminer toutes les séances utilisateur actives (sauf les administrateurs)",
        "effect3": "Nécessitent un déblocage manuel pour que les utilisateurs puissent retrouver l'accès",
        "confirm": "Êtes-vous sûr de vouloir procéder?",
        "okText": "Oui, bloquer les utilisateurs"
      },
      "confirmUnblock": {
        "title": "Débloquer les demandes des utilisateurs",
        "description": "Cela permettra à tous les utilisateurs de refaire des demandes au système. Es-tu sûr?",
        "okText": "Oui, débloquer"
      }
    },
    "exportVaults": {
      "title": "Exporter toutes les coffres",
      "description": "Téléchargez toutes les configurations de Vault Company, y compris les équipes, les régions, les ponts, les machines, les référentiels, le stockage et les horaires. Cette exportation contient des informations d'identification sensibles et doit être gérée en toute sécurité.",
      "button": "Exporter toutes les coffres",
      "success": "Vaults exportés avec succès",
      "error": "Échec de l'exportation des coffres"
    },
    "updateMasterPassword": {
      "title": "Paramètres de mot de passe de chiffrement",
      "description": "Configurez le mot de passe de chiffrement côté client qui protège toutes les données sensibles du vault dans votre organisation. Ce mot de passe est partagé entre tous les utilisateurs et n'est jamais accessible à Rediac pour une sécurité améliorée.",
      "effect1": "Reencyppt tous les coffres avec le nouveau mot de passe",
      "effect2": "Connectez tous les utilisateurs (sauf vous)",
      "effect3": "Exigent que tous les utilisateurs se connectent à nouveau après l'achèvement",
      "warning": "Stockez le nouveau mot de passe dans un emplacement sécurisé - il ne peut pas être récupéré s'il est perdu.",
      "button": "Perices de chiffrement",
      "modal": {
        "title": "Configuration du mot de passe de chiffrement",
        "operationType": "Sélectionner l'opération",
        "operationCreate": "Créer un mot de passe maître",
        "operationUpdate": "Mettre à jour le mot de passe maître",
        "operationRemove": "Supprimer le mot de passe maître",
        "warningTitle": "⚠️ opération de sécurité critique",
        "warningDescription": "Vous êtes sur le point de modifier le mot de passe principal de toute votre entreprise. Ce sera:",
        "warningDescriptionCreate": "Vous êtes sur le point de créer un mot de passe principal pour toute votre entreprise. Ce sera:",
        "warningDescriptionUpdate": "Vous êtes sur le point de mettre à jour le mot de passe maître pour toute votre entreprise. Ce sera:",
        "warningDescriptionRemove": "Vous êtes sur le point de supprimer le mot de passe principal de toute votre entreprise. Ce sera:",
        "warningEffect1": "Verrouiller le système temporairement pendant l'opération",
        "warningEffect2": "Connectez tous les utilisateurs actifs sauf vous",
        "warningEffect3": "Reencyppt toutes les données de coffre-fort avec le nouveau mot de passe",
        "warningEffect3Create": "Crypter toutes les données de coffre-fort avec le mot de passe maître",
        "warningEffect3Update": "Reencyppt toutes les données de coffre-fort avec le nouveau mot de passe",
        "warningEffect3Remove": "Décrypter toutes les données de coffre-fort (les coffres seront stockés non cryptés)",
        "warningEffect4": "Nécessitent une reconfiguration manuelle de tous les ponts",
        "warningPermanent": "Cette action est permanente et ne peut pas être annulée.",
        "warningSecure": "Avez-vous votre nouveau mot de passe stocké en toute sécurité?",
        "warningSecureRemove": "Êtes-vous sûr de vouloir supprimer le cryptage de tous les coffres?",
        "newPasswordLabel": "Nouveau mot de passe maître",
        "newPasswordPlaceholder": "Entrez le nouveau mot de passe maître",
        "newPasswordRequired": "Veuillez saisir le nouveau mot de passe maître",
        "newPasswordMinLength": "Le mot de passe doit comporter au moins 12 caractères",
        "newPasswordPattern": "Le mot de passe doit contenir des majuscules, des minuscules, un numéro et un caractère spécial",
        "confirmPasswordLabel": "Confirmer le mot de passe maître",
        "confirmPasswordPlaceholder": "Confirmer le nouveau mot de passe maître",
        "confirmPasswordRequired": "Veuillez confirmer le mot de passe maître",
        "confirmPasswordMatch": "Les mots de passe ne correspondent pas",
        "importantNote": "Après avoir mis à jour le mot de passe de chiffrement, tous les utilisateurs devront utiliser le nouveau mot de passe partagé pour accéder aux configurations du coffre-fort. Ce mot de passe doit être distribué en toute sécurité à tous les utilisateurs autorisés. Remarque: les ponts mondiaux avec requiertoken devront être débloqués manuellement.",
        "importantNoteCreate": "Après avoir créé le mot de passe de cryptage, tous les utilisateurs auront besoin de ce mot de passe partagé pour accéder aux configurations du coffre-fort. Distribuez-le en toute sécurité à tous les membres de l'entreprise autorisés - RediaCC n'a pas accès à ce mot de passe.",
        "importantNoteRemove": "Après avoir supprimé le mot de passe de chiffrement, les configurations de coffre-fort seront accessibles sans cryptage côté client. Considérez les implications de sécurité pour vos données sensibles.",
        "cancel": "Annuler",
        "submit": "Exécuter l'opération",
        "submitCreate": "Créer un mot de passe de chiffrement",
        "submitUpdate": "Mettre à jour le mot de passe de chiffrement",
        "submitRemove": "Supprimer le mot de passe de chiffrement"
      },
      "success": {
        "title": "L'opération terminée avec succès",
        "titleCreate": "Mot de passe de chiffrement créé avec succès",
        "titleUpdate": "Mot de passe de cryptage mis à jour avec succès",
        "titleRemove": "Mot de passe de chiffrement supprimé avec succès",
        "nextSteps": "Étapes suivantes:",
        "step1": "Tous les utilisateurs doivent se connecter à nouveau en utilisant leurs informations d'identification existantes",
        "step2": "Partagez en toute sécurité le nouveau mot de passe de chiffrement avec tous les utilisateurs autorisés de votre organisation",
        "step2Remove": "Informer les administrateurs selon lesquels les coffres ne sont désormais pas cryptés",
        "step3": "Vos propres ponts doivent être reconfigurés manuellement avec le nouveau mot de passe de chiffrement",
        "step3Remove": "Vos propres ponts doivent être reconfigurés manuellement sans cryptage côté client",
        "step4": "Mettez à jour le système de gestion des mots de passe de votre entreprise avec le nouveau mot de passe de cryptage partagé",
        "step4Remove": "Supprimer le mot de passe de cryptage du système de gestion des mots de passe de votre entreprise",
        "systemReady": "Le système est maintenant déverrouillé et prêt à l'emploi.",
        "redirecting": "Redirection vers la page de connexion dans",
        "seconds": "secondes",
        "loginNow": "Aller à se connecter maintenant"
      },
      "error": {
        "fetchVaults": "Échec de l'emploi de voûtes actuelles",
        "noVaults": "Aucune coagulation ne trouvait pour mettre à jour",
        "updateFailed": "Échec de la mise à jour des coffres avec un nouveau mot de passe de chiffrement",
        "partialSuccess": "Mise à jour {{mise à jour}} Vaults avec succès, mais {{{a échoué}} a échoué. Vérifiez les journaux pour plus de détails."
      }
    },
    "exportData": {
      "title": "Exporter les données de l'entreprise",
      "description": "Exporter toutes les données de l'entreprise, y compris les utilisateurs, les équipes, les autorisations, les régions, les ponts, les machines, les référentiels, les configurations de stockage et les horaires. Cette exportation peut être utilisée à des fins de sauvegarde ou de migration.",
      "button": "Exporter les données de l'entreprise",
      "success": "Les données de l'entreprise ont été exportées avec succès",
      "error": "Échec de l'exportation des données de l'entreprise",
      "downloading": "Préparation de l'exportation ..."
    },
    "importData": {
      "title": "Importer les données de l'entreprise",
      "description": "Importez les données de l'entreprise à partir d'un fichier précédemment exporté. Vous pouvez choisir de sauter les éléments existants ou de les remplacer avec les données importées.",
      "button": "Importer les données de l'entreprise",
      "success": "Les données de l'entreprise importées avec succès",
      "error": "Échec de l'importation des données de l'entreprise",
      "modal": {
        "title": "Importer les données de l'entreprise",
        "selectFile": "Sélectionner le fichier",
        "fileRequired": "Veuillez sélectionner un fichier à importer",
        "invalidFile": "Format de fichier non valide. Veuillez sélectionner un fichier d'exportation de données d'entreprise valide.",
        "importMode": "Mode d'importation",
        "modeSkip": "Sauter les articles existants",
        "modeOverride": "Remplacer les éléments existants",
        "modeSkipDesc": "Importer uniquement des éléments qui n'existent pas déjà",
        "modeOverrideDesc": "Remplacer les éléments existants par des données importées",
        "warning": "Avertissement",
        "warningText": "L'importation de données modifiera la configuration de votre entreprise. Assurez-vous d'avoir une sauvegarde avant de continuer.",
        "cancel": "Annuler",
        "import": "Importer",
        "importing": "Importation ..."
      }
    }
  },
  "userSessions": {
    "title": "Séances utilisateur",
    "totalSessions": "Sessions totales",
    "activeSessions": "Sessions actives",
    "uniqueUsers": "Utilisateurs uniques",
    "averageDuration": "Durée moyenne",
    "minutes": "minutes",
    "searchPlaceholder": "Recherche par e-mail, IP ou nom de session ...",
    "totalCount": "Total: {{comte}} Sessions",
    "currentSession": "Toi",
    "active": "Active",
    "inactive": "Inactive",
    "terminate": "Mettre fin",
    "confirmTerminate": "Résilier la session",
    "confirmTerminateSelf": "Ceci est votre session actuelle. Le terminer vous déconnectera. Es-tu sûr?",
    "confirmTerminateOther": "Êtes-vous sûr de vouloir résilier la session pour {{email}}?",
    "selfTerminateWarning": "Votre session sera terminée. Vous devrez vous connecter à nouveau.",
    "columns": {
      "user": "Utilisatrice",
      "sessionName": "Session",
      "ipAddress": "Adresse IP",
      "userAgent": "Agent utilisateur",
      "status": "Statut",
      "createdAt": "Temps de connexion",
      "lastActivity": "Dernière activité",
      "duration": "Durée",
      "actions": "Actes"
    }
  },
  "actions": {
    "createUser": "Créer un utilisateur",
    "createGroup": "Créer un groupe",
    "createTeam": "Créer une équipe",
    "changePassword": "Changer le mot de passe",
    "twoFactorAuth": "Authentification à deux facteurs",
    "addPermission": "Ajouter la permission",
    "addMember": "Ajouter un membre",
    "permissions": "Autorisation",
    "members": "Membres",
    "token": "Jeton",
    "resetAuth": "Réinitialiser l'authentique",
    "deactivate": "Désactiver",
    "configureVault": "Configurer Vault"
  }
}